#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Acquiring state lock. This may take a few moments...
github_team.all_users: Refreshing state... [id=9665234]
github_membership.admin["Tjacsen"]: Refreshing state... [id=CMCS-Norway:Tjacsen]
github_membership.admin["molldk"]: Refreshing state... [id=CMCS-Norway:molldk]
github_membership.admin["maos999"]: Refreshing state... [id=CMCS-Norway:maos999]
github_membership.admin["antnsn"]: Refreshing state... [id=CMCS-Norway:antnsn]
github_membership.admin["johnrosbe"]: Refreshing state... [id=CMCS-Norway:johnrosbe]
github_membership.admin["MrNewgarden"]: Refreshing state... [id=CMCS-Norway:MrNewgarden]
github_membership.admin["AndersLevin-GroupIT"]: Refreshing state... [id=CMCS-Norway:AndersLevin-GroupIT]
github_membership.admin["FredrikMelby"]: Refreshing state... [id=CMCS-Norway:FredrikMelby]
github_membership.admin["Flowlance"]: Refreshing state... [id=CMCS-Norway:Flowlance]
github_membership.admin["GlennIsb"]: Refreshing state... [id=CMCS-Norway:GlennIsb]
github_membership.users["KA-T1"]: Refreshing state... [id=CMCS-Norway:KA-T1]
github_membership.users["kojarB"]: Refreshing state... [id=CMCS-Norway:kojarB]
github_membership.users["Hawolex"]: Refreshing state... [id=CMCS-Norway:Hawolex]
github_membership.users["fabskab"]: Refreshing state... [id=CMCS-Norway:fabskab]
github_membership.users["emilihoo"]: Refreshing state... [id=CMCS-Norway:emilihoo]
github_membership.users["CMCS-PerH"]: Refreshing state... [id=CMCS-Norway:CMCS-PerH]
github_membership.users["xQseb"]: Refreshing state... [id=CMCS-Norway:xQseb]
github_membership.users["jenaslak"]: Refreshing state... [id=CMCS-Norway:jenaslak]
github_membership.users["trymhaak"]: Refreshing state... [id=CMCS-Norway:trymhaak]
github_membership.users["Danielbj01"]: Refreshing state... [id=CMCS-Norway:Danielbj01]
github_membership.users["irean"]: Refreshing state... [id=CMCS-Norway:irean]
github_membership.users["vagnes"]: Refreshing state... [id=CMCS-Norway:vagnes]
github_team_membership.all_users["MrNewgarden"]: Refreshing state... [id=9665234:MrNewgarden]
github_team_membership.all_users["AndersLevin-GroupIT"]: Refreshing state... [id=9665234:AndersLevin-GroupIT]
github_team_membership.all_users["FredrikMelby"]: Refreshing state... [id=9665234:FredrikMelby]
github_team_membership.all_users["trymhaak"]: Refreshing state... [id=9665234:trymhaak]
github_team_membership.all_users["emilihoo"]: Refreshing state... [id=9665234:emilihoo]
github_team_membership.all_users["CMCS-PerH"]: Refreshing state... [id=9665234:CMCS-PerH]
github_team_membership.all_users["vagnes"]: Refreshing state... [id=9665234:vagnes]
github_team_membership.all_users["antnsn"]: Refreshing state... [id=9665234:antnsn]
github_team_membership.all_users["fabskab"]: Refreshing state... [id=9665234:fabskab]
github_team_membership.all_users["xQseb"]: Refreshing state... [id=9665234:xQseb]
github_team_membership.all_users["Flowlance"]: Refreshing state... [id=9665234:Flowlance]
github_team_membership.all_users["Tjacsen"]: Refreshing state... [id=9665234:Tjacsen]
github_team_membership.all_users["jenaslak"]: Refreshing state... [id=9665234:jenaslak]
github_team_membership.all_users["KA-T1"]: Refreshing state... [id=9665234:KA-T1]
github_team_membership.all_users["Hawolex"]: Refreshing state... [id=9665234:Hawolex]
github_team_membership.all_users["maos999"]: Refreshing state... [id=9665234:maos999]
github_team_membership.all_users["Danielbj01"]: Refreshing state... [id=9665234:Danielbj01]
github_team_membership.all_users["molldk"]: Refreshing state... [id=9665234:molldk]
github_team_membership.all_users["johnrosbe"]: Refreshing state... [id=9665234:johnrosbe]
github_team_membership.all_users["GlennIsb"]: Refreshing state... [id=9665234:GlennIsb]
github_team_membership.all_users["irean"]: Refreshing state... [id=9665234:irean]
github_team_membership.all_users["kojarB"]: Refreshing state... [id=9665234:kojarB]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_team.platform will be created
  + resource "github_team" "platform" {
      + create_default_maintainer = false
      + description               = "platform team members."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "platform"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.platform["Flowlance"] will be created
  + resource "github_team_membership" "platform" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "Flowlance"
    }

  # github_team_membership.platform["FredrikMelby"] will be created
  + resource "github_team_membership" "platform" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "FredrikMelby"
    }

  # github_team_membership.platform["KA-T1"] will be created
  + resource "github_team_membership" "platform" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "KA-T1"
    }

  # github_team_membership.platform["MrNewgarden"] will be created
  + resource "github_team_membership" "platform" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "MrNewgarden"
    }

  # github_team_membership.platform["antnsn"] will be created
  + resource "github_team_membership" "platform" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "antnsn"
    }

  # github_team_membership.platform["fabskab"] will be created
  + resource "github_team_membership" "platform" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "fabskab"
    }

  # github_team_membership.platform["johnrosbe"] will be created
  + resource "github_team_membership" "platform" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "johnrosbe"
    }

  # github_team_membership.platform["maos999"] will be created
  + resource "github_team_membership" "platform" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "maos999"
    }

  # github_team_membership.platform["xQseb"] will be created
  + resource "github_team_membership" "platform" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "xQseb"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @antnsn, Action: `pull_request`*